tello-v12/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 1.0;
boundaryField
{
    outlet-2
    {
        type inletOutlet;
        inletValue uniform 1.0;
        value uniform 1.0;
    }
    inlet-2
    {
        type inletOutlet;
        inletValue uniform 1.0;
        value uniform 1.0;
    }
    side-2
    {
        type inletOutlet;
        inletValue uniform 1.0;
        value uniform 1.0;
    }
    tello-blade-customv2
    {
        type            kLowReWallFunction;
        value           uniform 1.0; 
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
