tello-v12/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    outlet-2
    {
        type calculated;
        value uniform 0;
    }
    inlet-2
    {
        type calculated;
        value uniform 0;
    }
    side-2
    {
        type calculated;
        value uniform 0;
    }
    tello-blade-customv2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
