tello-v12/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      omega;
}
dimensions [0 0 -1 0 0 0 0];
internalField uniform 5000;
boundaryField
{
    outlet-2
    {
        type inletOutlet;
        inletValue uniform 5000;
        value uniform 5000;
    }
    inlet-2
    {
        type inletOutlet;
        inletValue uniform 5000;
        value uniform 5000;
    }
    side-2
    {
        type inletOutlet;
        inletValue uniform 5000;
        value uniform 5000;
    }
    tello-blade-customv2
    {
        type omegaWallFunction;
        value uniform 5000;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
