tello-v12/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
surfaces
(
    "Assembly.stl"
    "inlet-2.stl"
    "outlet-2.stl"
    "side-2.stl"
);
includedAngle 30.0;
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
writeObj yes;
